from numpy import array
from keras.models import Sequential
from keras.layers import Dense, LSTM


#데이터 

x = array([[1, 2, 3], [2, 3, 4], [3, 4, 5], [4, 5, 6]]) 
y1 = array([4, 5, 6, 7]) 
y2 = array([[4, 5, 6, 7]])
y3 = array([[4], [5], [6], [7]])


print("x.shape : ", x.shape)    # (4,3)
print("y1.shape : ", y1.shape)  # (4, )    
print("y2.shape : ", y2.shape)  # (1,4)    
print("y3.shape : ", y3.shape)  # (4,1)    

'''

여기서 (4,3)을 (4,3,1)로 바꿔주면 개체들이 각각 묶이게 된다!
-> [[[1],[2],[3]], [[2],[3],[4]], [[3],[4],[5]], [[4],[5],[6]]]
-> 이제 한 개씩 작업할 수 있겠다 

'''
x = x.reshape(4, 3, 1)
# x = x.reshape(x.shape[0], x.shape[1], 1)

print(x.shape)  # (4, 3, 1)   

# 모두 곱해봐서 값이 맞는지 확인 


'''
y.shape  ->   왜 (4,1)가 아나고 (4,)일까?? 

(4,1) 해버리면 에러난다 난리난다 

(4,1)는 벡터이고 (4,)는 스칼라이므로 둘은 같지 않다(?)


(1) - array []
([1,2]) - array [2]
([1,2,3]) - array [3]
([[1,2,3], [4,5,6]]) -array(2,3)
([[1,2,3],[4,5,6],[7,8,9]]) - arrray(3,3)


1 - [[1,2,3], [1,2,3]] - array(2,3)
2 - [[[1,2],[4,3]], [[4,5],[5,6]]]- array(2,2,2)
3 - [[[1],[2],[3]],[[4],[5],[6]]] - array(2,3,1)
4 - [[[1,2,3,4]]] - array(1,1,4) 
5 - [[[[1],[2]]]],[[[3],[4]]]] - array (1,2,2,1)

# 헷갈리면 가장 작은 차원부터 올라오자  

'''

# 2. 모델 구성

model = Sequential()
model.add(LSTM(10, activation='relu', input_shape = (3,1)))  

'''

결국 이것도 행무시와 같은 맥락 

x에는 스칼라 3종류를 가진 2차원 데이터 '4개'가 있다. 다음에도 추가될 데이터도 같은 규격. 각각의 2차원 데이터를 input 하는 것

즉, 만약 1년치 데이터가 있을때, 그냥 365일 통쨰로 넣어도 되고 대략 (12,30) 으로 나눠서 넣어도 된다는 소리다.



'''

model.add(Dense(5))
model.add(Dense(1))


model.summary()

'''
Model: "sequential_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
lstm_1 (LSTM)                (None, 10)                480
_________________________________________________________________
dense_1 (Dense)              (None, 5)                 55
_________________________________________________________________
dense_2 (Dense)              (None, 1)                 6
=================================================================
Total params: 541
Trainable params: 541
Non-trainable params: 0

레이어하고 노드를 얼마 넣지도 않았는데 params이 저모양이다. 괜히 느리다고 하는게 아니다. 


'''